xively/xively-client-c/examples/cc3200/xively_firmware_updates/SFT/xi_sft_client.c
typedef struct xi_sft_file_chunk_s
{
    uint offset;
    uint chunk_length;
    uint array_length;
    uint status;
    unsigned char* byte_array;
} xi_sft_file_chunk_t;

int xi_parse_file_chunk(cn_cbor* in_cb, xi_sft_file_chunk_t* out_sft_file_chunk )
{
    if( NULL == in_cb || NULL == out_sft_file_chunk )
    {
        return -1;
    }

    cn_cbor *cb_item = NULL;
    memset( out_sft_file_chunk, 0, sizeof(xi_sft_file_chunk_t) );

    //
    // msg version
    //
    cb_item = cn_cbor_mapget_string( in_cb, "msgver" );
    if(cb_item)
    {
        if( 1 != cb_item->v.uint )
        {
            printf( "FILE_CHUNK unsupported message version: %d\n", cb_item->v.uint );
            return -1;
        }
    }
    else
    {
       printf( "FILE_CHUNK message missing message version field\n" );
       return -1;
    }

    //
    // chunk offset
    //
    cb_item = cn_cbor_mapget_string( in_cb, "O" );
    if( cb_item )
    {
       out_sft_file_chunk->offset = cb_item->v.uint;
    }
    else
    {
        printf("FILE_CHUNK message missing offset field\n");
        return -1;
    }

    //
    // chunk length
    //
    cb_item = cn_cbor_mapget_string( in_cb, "L" );
    if( cb_item )
    {
        out_sft_file_chunk->chunk_length = cb_item->v.uint;
    }
    else
    {
        printf( "FILE_CHUNK message missing length field\n" );
        return -1;
    }

    //
    // Status
    //
    cb_item = cn_cbor_mapget_string( in_cb, "S" );
    if( cb_item )
    {
        out_sft_file_chunk->status = cb_item->v.uint;
    }
    else
    {
        printf( "FILE_CHUNK message missing status field\n" );
        return -1;
    }

    //
    // Byte Array
    //
    cb_item = cn_cbor_mapget_string( in_cb, "C" );
    if(cb_item)
    {
        out_sft_file_chunk->array_length = cb_item->length;
        out_sft_file_chunk->byte_array = (unsigned char *)cb_item->v.str;
    }
    else
    {
        printf( "FILE_CHUNK message missing byte array field\n" );
    }

    return 0;
}

/* Parses a chunk of file data
 * and detects if the file has completely downloaded.
 */
void xi_file_chunk_handler( cn_cbor *cb ) {

    unsigned chunkoffset = 0;
    int retval;

    if( xi_download_light_state )
    {
        xi_download_light_state = 0;
        GPIO_IF_LedOff( MCU_RED_LED_GPIO );
    }
    else
    {
        xi_download_light_state = 1;
        GPIO_IF_LedOn( MCU_RED_LED_GPIO );
    }

#if 1
    xi_sft_file_chunk_t file_chunk_struct;
    if ( 0 != xi_parse_file_chunk( cb, &file_chunk_struct ) )
    {
        printf("xi_file_chunk_handler encountered error calling xi_parse_file_chunk\n");
        printf("aborting file download\n");
        return;
    }

    if( file_chunk_struct.status != 0 )
    {

        printf( "NON ZERO STATUS: %d\n", file_chunk_struct.status );
        printf( "chunk_length: %d\n", file_chunk_struct.chunk_length );
        printf( "array_length: %d\n", file_chunk_struct.array_length );
        printf( "offset: %d\n", file_chunk_struct.offset );
        downloading = 0;
    }

    if( currenttenpercent < file_chunk_struct.array_length )
    {
        /* Yes, I know this is terrible, but it's the level of effort appropriate to the task. */
        printf("Downloaded %d bytes %d %%  of the file \n",offset, (100 * (currenttenpercent + 1000)) / filelength);
        currenttenpercent += tenpercent;
    }

    int write_length = file_chunk_struct.array_length;
    if( chunkoffset + write_length > filelength )
    {
        write_length = filelength - file_chunk_struct.offset ;
        downloading = 0;
    }

    sha256_update(&ctx, file_chunk_struct.byte_array, write_length );

    retval = sl_extlib_FlcWriteFile( lFileHandle, file_chunk_struct.offset, file_chunk_struct.byte_array, write_length );
    if( retval < file_chunk_struct.chunk_length )
    {
        downloading = 0;
    }

//    printf( "Write returned %d\n", retval );
//    printf("File chunk request params:\n");
    int messageType = XI_FILE_GET_CHUNK;
    int messageVersion = 1;
    int messageLength = 1024;
    int next_request_offset = file_chunk_struct.offset + write_length;
//    printf("msgtype: %d\n", messageType );
//    printf("msgver: %d\n", messageVersion);
//    printf("N: \"%s\"\n", incomingFilename);
//    printf("R: \"%s\"\n", fileRevision);
//    printf("O: %d\n",  next_request_offset );
//    printf("L: %d\n", messageLength);

    if( 1 == downloading  )
    {
        /* Let's try making a GET_CHUNK packet */
        printf( "creating get_chunk packet.offset: %d length: %d   previouslyWrote: %d bytes of chunk length: %d\n", next_request_offset, messageLength, retval, file_chunk_struct.chunk_length );
        cn_cbor_errback err;
        cn_cbor *cb_map = cn_cbor_map_create(&err);

        cn_cbor_map_put(cb_map,
                        cn_cbor_string_create("msgtype", &err),
                        cn_cbor_int_create(messageType, &err), &err);
        cn_cbor_map_put(cb_map,
                        cn_cbor_string_create("msgver", &err),
                        cn_cbor_int_create(messageVersion, &err), &err);
        cn_cbor_map_put(cb_map,
                        cn_cbor_string_create("N", &err),
                        cn_cbor_string_create(incomingFilename, &err),
                        &err);
        cn_cbor_map_put(cb_map,
                        cn_cbor_string_create("R", &err),
                        cn_cbor_string_create(fileRevision, &err),
                        &err);
        cn_cbor_map_put(cb_map,
                        cn_cbor_string_create("O", &err),
                        cn_cbor_int_create(next_request_offset, &err), &err);
        cn_cbor_map_put(cb_map,
                        cn_cbor_string_create("L", &err),
                        cn_cbor_int_create(messageLength, &err), &err);

        enc_sz = cn_cbor_encoder_write(encoded, 0, sizeof(encoded), cb_map);
        cn_cbor_free(cb_map CBOR_CONTEXT_PARAM);
    }


#else
    uint msg_version = 0;
    uint offset = 0;
    uint chunk_length = 0;
    uint array_length = 0;
    uint binary_array_length = 0;
    uint next_request_offset = 0;

    //
    // msg version
    //
    cb_item = cn_cbor_mapget_string(in_cb, "msgver");
    if(cb_item)
    {
        out_sft_file_chunk = cb_item->v.uint;
    }
    else
    {
       printf("FILE_CHUNK message missing message version field\n");
    }


    //
    // chunk offset
    //
    cb_item = cn_cbor_mapget_string(cb, "O");
    if( cb_item )
    {
       offset = cb_item->v.uint;
    }
    else
    {
        printf("FILE_CHUNK message missing offset field\n");
    }

    //
    // chunk length
    //
    cb_item = cn_cbor_mapget_string(cb, "L");
    if(cb_item)
    {
        chunk_length = cb_item->v.uint;

        if( currenttenpercent < offset )
        {
            /* Yes, I know this is terrible, but it's the level of effort appropriate to the task. */
        	    printf("Downloaded %d bytes %d %%  of the file \n",offset, (100 * (currenttenpercent + 1000)) / filelength);
        	    currenttenpercent += tenpercent;
        }
    }
    else
    {
        printf( "FILE_CHUNK message missing length field\n" );
    }

    cb_item = cn_cbor_mapget_string(cb, "C");
    if(cb_item)
    {
        array_length = cb_item->length;

        if( cb_item->length != chunk_length )
        {
            printf( "MISMATCH chunk length: %d  array length: %d\n", chunk_length, array_length );
        }

        if( array_length > 0)
        {
            int write_length = array_length;
            if( chunkoffset + array_length > filelength )
            {
                write_length = filelength - chunkoffset ;
                downloading = 0;
            }

