xively/xively-client-c/examples/cc3200/xively_firmware_updates/SFT/xi_sft_client.c
            sha256_update(&ctx,(unsigned char *)cb_item->v.str,cb_item->length);

            retval = sl_extlib_FlcWriteFile( lFileHandle, chunkoffset, (unsigned char *)cb_item->v.str, write_length );
            if( retval < array_length )
            {
                downloading = 0;
            }
            printf("Write returned %d\n",retval);

            next_request_offset = offset + retval;
            if( (chunkoffset + array_length ) >= filelength )
            {
                downloading = 0;
            }
        }
        else
        {
            downloading = 0;
        }
    }
    else
    {
        printf("No key called C\n");
    }

    //
    // TODO: What's this about? It's a string evnaluated as an int?
    //
    cb_item = cn_cbor_mapget_string(cb, "S");
    if(cb_item)
    {
        if(cb_item->v.uint > 1)
        {
            downloading = 0;
        	    sl_extlib_FlcCloseFile(lFileHandle, NULL, NULL, 0);
        }
    }
    else
    {
        printf("No key called S\n");
    }

    printf("File chunk request params:\n");
    int messageType = XI_FILE_GET_CHUNK;
    int messageVersion = 1;
    int messageLength = 1024;
    printf("msgtype: %d\n", messageType);
    printf("msgver: %d\n", messageVersion);
    printf("N: \"%s\"\n", incomingFilename);
    printf("R: \"%s\"\n", fileRevision);
    printf("O: %d\n", next_request_offset);
    printf("L: %d\n", messageLength);

    if( 1 == downloading && next_request_offset != 0 )
    {
		/* Let's try making a GET_CHUNK packet */
        printf("creating get_chunk packet\n");
		cn_cbor_errback err;
		cn_cbor *cb_map = cn_cbor_map_create(&err);

		cn_cbor_map_put(cb_map,
						cn_cbor_string_create("msgtype", &err),
						cn_cbor_int_create(messageType, &err), &err);
		cn_cbor_map_put(cb_map,
						cn_cbor_string_create("msgver", &err),
						cn_cbor_int_create(messageVersion, &err), &err);
		cn_cbor_map_put(cb_map,
						cn_cbor_string_create("N", &err),
						cn_cbor_string_create(incomingFilename, &err),
						&err);
		cn_cbor_map_put(cb_map,
						cn_cbor_string_create("R", &err),
						cn_cbor_string_create(fileRevision, &err),
						&err);
		cn_cbor_map_put(cb_map,
						cn_cbor_string_create("O", &err),
						cn_cbor_int_create(next_request_offset, &err), &err);
		cn_cbor_map_put(cb_map,
						cn_cbor_string_create("L", &err),
						cn_cbor_int_create(messageLength, &err), &err);

		enc_sz = cn_cbor_encoder_write(encoded, 0, sizeof(encoded), cb_map);
		cn_cbor_free(cb_map CBOR_CONTEXT_PARAM);
    }
#endif

}

int
xi_sft_init(xi_context_handle_t in_context_handle, char *account_id, char *device_id) {
	int r = -1;

	readBootinfo();
	printf("******************* Committing this revision May9th \n");
	// Accept the latest firmware if we get here.
	if( sl_extlib_FlcIsPendingCommit() )
	{
	    printf(" Result: %d\n", sl_extlib_FlcCommit(FLC_COMMITED) );
	}
	else
	{
	    printf("no pending commit found\n");
	}

	readBootinfo();

	if(NULL == account_id) return(-1);
	if(NULL == device_id) return(-1);

	// xi_stopic is the MQTT topic we PUB to to send messages to the broker.
	snprintf(xi_stopic, sizeof(xi_stopic),"xi/ctrl/v1/%s/svc", device_id);

	// xi_ctopic is the MQTT topic we SUBSCRIBE to to receive messages from the broker.
	snprintf(xi_ctopic, sizeof(xi_ctopic),"xi/ctrl/v1/%s/cln", device_id);

	// xi_logtopic is the MQTT topic we PUB to to add log messages.
	snprintf(xi_logtopic, sizeof(xi_logtopic),"xi/blue/v1/%s/d/%s/_log",account_id, device_id);

	// Everything interesting happens in the on_sft_message() state machine.
	r = xi_subscribe(in_context_handle, xi_ctopic, XI_MQTT_QOS_AT_MOST_ONCE, on_sft_message, 0 );
	printf("xi_subscribe() topic: %s returns %d\n",xi_ctopic, r);

	return(0);
}


// Functions useful for debugging:
#ifdef XI_DEBUGSFT
void dump(const cn_cbor* cb, char* out, char** end, int indent) {
    int i;
    cn_cbor* cp;
    char finchar = ')';           /* most likely */

#define CPY(s, l) memcpy(out, s, l); out += l;
#define OUT(s) CPY(s, sizeof(s)-1)
#define PRF(f, a) out += sprintf(out, f, a)

    if (!cb)
        goto done;

    for (i = 0; i < indent; i++) *out++ = ' ';
    switch (cb->type) {
        case CN_CBOR_TEXT_CHUNKED:   OUT("(_\n");                  goto sequence;
        case CN_CBOR_BYTES_CHUNKED:  OUT("(_\n\n");                goto sequence;
        case CN_CBOR_TAG:            PRF("%ld(\n", cb->v.sint);    goto sequence;
        case CN_CBOR_ARRAY:  finchar = ']'; OUT("[\n");            goto sequence;
        case CN_CBOR_MAP:    finchar = '}'; OUT("{\n");            goto sequence;
        sequence:
            for (cp = cb->first_child; cp; cp = cp->next) {
                dump(cp, out, &out, indent+2);
            }
            for (i=0; i<indent; i++) *out++ = ' ';
            *out++ = finchar;
            break;
        case CN_CBOR_BYTES:   OUT("h'\n");
            for (i=0; i<cb->length; i++) {
                PRF("%02x ", cb->v.str[i] & 0xff);
            }

            *out++ = '\'';
            break;
        case CN_CBOR_TEXT:    *out++ = '"';
            CPY(cb->v.str, cb->length); /* should escape stuff */
            *out++ = '"';
            break;
        case CN_CBOR_NULL:   OUT("null");                      break;
        case CN_CBOR_TRUE:   OUT("true");                      break;
        case CN_CBOR_FALSE:  OUT("false");                     break;
        case CN_CBOR_UNDEF:  OUT("simple(23)");                break;
        case CN_CBOR_INT:    PRF("%ld", cb->v.sint);           break;
        case CN_CBOR_UINT:   PRF("%lu", cb->v.uint);           break;
        case CN_CBOR_DOUBLE: PRF("%e", cb->v.dbl);             break;
        case CN_CBOR_SIMPLE: PRF("simple(%ld)", cb->v.sint);   break;
        default:             PRF("???%d???", cb->type);        break;
    }
    *out++ = '\n';
done:
    *end = out;
}
#endif
